# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\michael.machate\Desktop\CY8CKIT-145 Code Example\CE210709_CapSense_Linear_Slider_and_Buttons\CE210709_CapSense_Linear_Slider_and_Buttons.cydsn\CE210709_CapSense_Linear_Slider_and_Buttons.cyprj
# Date: Wed, 01 Aug 2018 09:50:39 GMT
#set_units -time ns
create_clock -name {CapSense_ModClk(FFB)} -period 10625 -waveform {0 5312.5} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {EZI2C_SCBCLK(FFB)} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {Clock_1(FFB)} -period 500 -waveform {0 250} [list [get_pins {ClockBlock/ff_div_3}] [get_pins {ClockBlock/ff_div_4}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {CapSense_ModClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 255 511} [list]
create_generated_clock -name {EZI2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 7} [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 13 25} [list]


# Component constraints for C:\Users\michael.machate\Desktop\CY8CKIT-145 Code Example\CE210709_CapSense_Linear_Slider_and_Buttons\CE210709_CapSense_Linear_Slider_and_Buttons.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\michael.machate\Desktop\CY8CKIT-145 Code Example\CE210709_CapSense_Linear_Slider_and_Buttons\CE210709_CapSense_Linear_Slider_and_Buttons.cydsn\CE210709_CapSense_Linear_Slider_and_Buttons.cyprj
# Date: Wed, 01 Aug 2018 09:50:38 GMT
